KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32H735.svd
          <register>
            <name>OTFDEC_R2NONCER1</name>
            <displayName>OTFDEC_R2NONCER1</displayName>
            <description>OTFDEC region 2 nonce register 1</description>
            <addressOffset>0x60</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>REGx_NONCE</name>
                <description>Region nonce, bits [63:32]
Refer to the OTFDEC_RxNONCER0 register for description of the NONCE[63:0] bitfield.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OTFDEC_R2KEYR0</name>
            <displayName>OTFDEC_R2KEYR0</displayName>
            <description>OTFDEC region 2 key register 0</description>
            <addressOffset>0x64</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>REGx_KEY</name>
                <description>Region key, bits [31:0]
This register must be written before the region corresponding REG_EN bit in the RxCFGR register is set.
Reading this register returns a zero value. Writing this register while the region CONFIGLOCK or KEYLOCK bit is set in the RxCFGR register will be discarded.
Note: When application successfully changes MODE bits in RxCFGR register RxKEYR registers and associated KEYCRC are erased.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OTFDEC_R2KEYR1</name>
            <displayName>OTFDEC_R2KEYR1</displayName>
            <description>OTFDEC region 2 key register 1</description>
            <addressOffset>0x68</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>REGx_KEY</name>
                <description>Region key, bits [63:32]
Refer to the OTFDEC_RxKEYR0 register for description of the KEY[127:0] bitfield.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OTFDEC_R2KEYR2</name>
            <displayName>OTFDEC_R2KEYR2</displayName>
            <description>OTFDEC region 2 key register 2</description>
            <addressOffset>0x6c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>REGx_KEY</name>
                <description>Region key, bits [95:64]
Refer to the OTFDEC_RxKEYR0 register for description of the KEY[127:0] bitfield.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OTFDEC_R2KEYR3</name>
            <displayName>OTFDEC_R2KEYR3</displayName>
            <description>OTFDEC region 2 key register 3</description>
            <addressOffset>0x70</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>REGx_KEY</name>
                <description>Region key, bits [127:96]
Refer to the OTFDEC_RxKEYR0 register for description of the KEY[127:0] bitfield.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OTFDEC_R3CFGR</name>
            <displayName>OTFDEC_R3CFGR</displayName>
            <description>OTFDEC region 3 configuration register</description>
            <addressOffset>0x80</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>REG_EN</name>
                <description>region on-the-fly decryption enable
Note: When this bit is set region context (version, key, nonce) must be valid or garbage will be decrypted.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>On-the-fly decryption is disabled for this region.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>On-the-fly decryption is enabled for this region. Data are XORed with the corresponding keystream.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CONFIGLOCK</name>
                <description>region config lock
This bit-field is set once, i.e. if this bit is set it can only be reset to '0' if OTFDEC is reset.
Setting this bit forces KEYLOCK bit to '1'.</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writes to this region CFGR1, STARTADDR, ENDADDR and NONCERx registers are allowed.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writes to this region CFGR1, STARTADDR, ENDADDR and NONCERx registers are ignored until next OTFDEC reset.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>KEYLOCK</name>
                <description>region key lock
This bitfield is set once, i.e. if this bit is set it can only be reset to '0' if the OTFDEC is reset.</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Writes to this region KEYRx registers are allowed.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Writes to this region KEYRx registers are ignored until next OTFDEC reset. KEYCRC bitfield is locked.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MODE</name>
                <description>operating mode
This bitfield selects the OTFDEC operating mode for this region:
When MODE is not equal to 11 the standard AES encryption mode is activated.
When either of the MODE bits are changed the region's key and associated CRC are zeroed.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>B_0x0</name>
                    <description>Only instruction accesses are decrypted.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x1</name>
                    <description>Only data accesses are decrypted.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x2</name>
                    <description>All read accesses are decrypted (instruction or data).</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>B_0x3</name>
                    <description>Only instruction accesses are decrypted, and enhanced encryption mode is activated.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>KEYCRC</name>
                <description>region key 8-bit CRC
When KEYLOCK=0, KEYCRC bitfield is automatically computed by hardware while loading the key of this region in this exact sequence: KEYR0 then KEYR1 then KEYR2 then finally KEYR3 (all written once). A new computation starts as soon as a new valid sequence is initiated, and KEYCRC is read as zero until a valid sequence is completed.
When KEYLOCK=1, KEYCRC remains unchanged until the next reset.
CRC computation is an 8-bit checksum using the standard CRC-8-CCITT algorithm X8 + X2 + X + 1 (according the convention). Source code is available in this manual.
This field is read only.
Note: CRC information is updated only after the last bit of the key has been written.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>REGx_VERSION</name>
                <description>region firmware version
This 16-bit bitfield must be correctly initialized before the region corresponding REG_EN bit is set in the RxCFGR register.</description>
                <bitOffset>16</bitOffset>
                <bitWidth>16</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
		  <register>
            <name>OTFDEC_R3STARTADDR</name>
            <displayName>OTFDEC_R3STARTADDR</displayName>
            <description>OTFDEC region 3 start address register</description>
            <addressOffset>0x84</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>REGx_START_ADDR</name>
                <description>Region AXI start address
This register must be written before the region corresponding REG_EN bit in the RxCFGR register is set.
Writing this register while the region CONFIGLOCK bit in the RxCFGR register is set will be discarded.
Note: When determining the region the first 12 bits (LSB) and the last 4 bits (MSB) are ignored.
When this register is accessed in read the 4 MSB bits and the 12 LSB bits return zero.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OTFDEC_R3ENDADDR</name>
            <displayName>OTFDEC_R3ENDADDR</displayName>
            <description>OTFDEC region 3 end address register</description>
            <addressOffset>0x88</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000FFF</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>REGx_END_ADDR</name>
                <description>Region AXI end address
This register must be written before the region corresponding REG_EN bit in the RxCFGR register is set, and RxENDADDR must be strictly greater than RxSTARTADDR to be valid.
Writing this register while the region CONFIGLOCK bit in the RxCFGR register is set will be discarded.
Note: When determining the region the first 12 bits (LSB) and the last 4 bits (MSB) are ignored.
When this register is accessed in read the 4 MSB bits returns zeros and the 12 LSB bits return ones.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OTFDEC_R3NONCER0</name>
            <displayName>OTFDEC_R3NONCER0</displayName>
            <description>OTFDEC region 3 nonce register 0</description>
            <addressOffset>0x8c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>REGx_NONCE</name>
                <description>Region nonce, bits [31:0]
This register must be written before the region corresponding REG_EN bit in the RxCFGR register is set.
Writing this register while the region CONFIGLOCK bit in the RxCFGR register is set will be discarded.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OTFDEC_R3NONCER1</name>
            <displayName>OTFDEC_R3NONCER1</displayName>
            <description>OTFDEC region 3 nonce register 1</description>
            <addressOffset>0x90</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>REGx_NONCE</name>
                <description>Region nonce, bits [63:32]
Refer to the OTFDEC_RxNONCER0 register for description of the NONCE[63:0] bitfield.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OTFDEC_R3KEYR0</name>
            <displayName>OTFDEC_R3KEYR0</displayName>
            <description>OTFDEC region 3 key register 0</description>
            <addressOffset>0x94</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>REGx_KEY</name>
                <description>Region key, bits [31:0]
This register must be written before the region corresponding REG_EN bit in the RxCFGR register is set.
Reading this register returns a zero value. Writing this register while the region CONFIGLOCK or KEYLOCK bit is set in the RxCFGR register will be discarded.
Note: When application successfully changes MODE bits in RxCFGR register RxKEYR registers and associated KEYCRC are erased.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OTFDEC_R3KEYR1</name>
            <displayName>OTFDEC_R3KEYR1</displayName>
            <description>OTFDEC region 3 key register 1</description>
            <addressOffset>0x98</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>REGx_KEY</name>
                <description>Region key, bits [63:32]
Refer to the OTFDEC_RxKEYR0 register for description of the KEY[127:0] bitfield.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OTFDEC_R3KEYR2</name>
            <displayName>OTFDEC_R3KEYR2</displayName>
            <description>OTFDEC region 3 key register 2</description>
            <addressOffset>0x9c</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>REGx_KEY</name>
                <description>Region key, bits [95:64]
Refer to the OTFDEC_RxKEYR0 register for description of the KEY[127:0] bitfield.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>OTFDEC_R3KEYR3</name>
            <displayName>OTFDEC_R3KEYR3</displayName>
            <description>OTFDEC region 3 key register 3</description>
            <addressOffset>0xa0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>REGx_KEY</name>
                <description>Region key, bits [127:96]
Refer to the OTFDEC_RxKEYR0 register for description of the KEY[127:0] bitfield.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
