KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32H735.svd
        <register>
          <name>SAI_BCLRFR</name>
          <displayName>SAI_BCLRFR</displayName>
          <description>Clear flag register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COVRUDR</name>
              <description>Clear overrun / underrun. This bit is
              write only. Programming this bit to 1 clears the
              OVRUDR flag in the SAI_xSR register. Reading this bit
              always returns the value 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMUTEDET</name>
              <description>Mute detection flag. This bit is write
              only. Programming this bit to 1 clears the MUTEDET
              flag in the SAI_xSR register. Reading this bit always
              returns the value 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CWCKCFG</name>
              <description>Clear wrong clock configuration flag.
              This bit is write only. Programming this bit to 1
              clears the WCKCFG flag in the SAI_xSR register. This
              bit is used only when the audio block is set as
              master (MODE[1] = 0) and NODIV = 0 in the SAI_xCR1
              register. Reading this bit always returns the value
              0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCNRDY</name>
              <description>Clear Codec not ready flag. This bit is
              write only. Programming this bit to 1 clears the
              CNRDY flag in the SAI_xSR register. This bit is used
              only when the AC97 audio protocol is selected in the
              SAI_xCR1 register. Reading this bit always returns
              the value 0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAFSDET</name>
              <description>Clear anticipated frame synchronization
              detection flag. This bit is write only. Programming
              this bit to 1 clears the AFSDET flag in the SAI_xSR
              register. It is not used in AC97or SPDIF mode.
              Reading this bit always returns the value
              0.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLFSDET</name>
              <description>Clear late frame synchronization
              detection flag. This bit is write only. Programming
              this bit to 1 clears the LFSDET flag in the SAI_xSR
              register. This bit is not used in AC97or SPDIF mode
              Reading this bit always returns the value
              0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI_BDR</name>
          <displayName>SAI_BDR</displayName>
          <description>Data register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data A write to this register loads the
              FIFO provided the FIFO is not full. A read from this
              register empties the FIFO if the FIFO is not
              empty.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI_PDMCR</name>
          <displayName>SAI_PDMCR</displayName>
          <description>PDM control register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PDMEN</name>
              <description>PDM enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MICNBR</name>
              <description>Number of microphones</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CKEN1</name>
              <description>Clock enable of bitstream clock number
              1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKEN2</name>
              <description>Clock enable of bitstream clock number
              2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKEN3</name>
              <description>Clock enable of bitstream clock number
              3</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKEN4</name>
              <description>Clock enable of bitstream clock number
              4</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAI_PDMDLY</name>
          <displayName>SAI_PDMDLY</displayName>
          <description>PDM delay register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DLYM1L</name>
              <description>Delay line adjust for first microphone
              of pair 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DLYM1R</name>
              <description>Delay line adjust for second microphone
              of pair 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DLYM2L</name>
              <description>Delay line for first microphone of pair
              2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DLYM2R</name>
              <description>Delay line for second microphone of pair
              2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DLYM3L</name>
              <description>Delay line for first microphone of pair
              3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DLYM3R</name>
              <description>Delay line for second microphone of pair
              3</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DLYM4L</name>
              <description>Delay line for first microphone of pair
              4</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DLYM4R</name>
              <description>Delay line for second microphone of pair
              4</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
